package com.example.yuuuuu.sample;

/**
 * Created by YUUUUU on 2017-08-15.
 * [i][0] : 올림픽 경기가 진행되는 날짜(2월)
 * [i][1] : 해당 날짜의 경기 수
 */

public class SportDate {

    private String[][] date = {
            {"8","2","컬링", "스키점프"},
            {"9","3","개회식", "컬링", "피겨스케이팅", "프리스타일스키"},
            {"10","9","바이애슬론","크로스컨트리스키","컬링", "아이스하키","루지","쇼트트랙스피드스케이팅","스키점프","스노보드","스피드스케이팅"},
            {"11","10", "알파인스키","바이애슬론","크로스컨트리스키","컬링","피켜스케이팅","프리스타일스키","아이스하키","루지","스노보드","스피드스케이팅"},
            {"12","10","알파인스키","바이애슬론","컬링","피겨스케이팅","프리스타일스키","아이스하키","루지","스키점프","스노보드","스피드스케이팅"},
            {"13","8","알파인스키","크로스컨트리스키","컬링","아이스하키","루지","쇼트트랙스피드스케이팅","스노보드","스피드스케이팅"},
            {"14","9","알파인스키","바이애슬론","컬링","피켜스케이팅","아이스하키","루지","노르딕복합","스노보드","스피드스케이팅"},
            {"15","9","알파인스키","바이애슬론","크로스컨트리스키","컬링","피켜스케이팅","프리스타일스키","아이스하키","루지","스켈레톤","스노보드","스피드스케이팅"},
            {"16","7","크로스컨트리스키","컬링","피켜스케이팅","프리스타일스키","아이스하키","스켈레톤","스키점프","스노보드","스피드스케이팅"},
            {"17","10","알파인스키","바이애슬론","크로스컨트리스키","컬링","피켜스케이팅","프리스타일스키","아이스하키","쇼트트랙스피드스케이팅","스켈레톤","스키점프"},
            {"18","7","알파인스키","바이애슬론","크로스컨트리스키","컬링","프리스타일스키","아이스하키","스피드스케이팅"},
            {"19","8","봅슬레이","컬링","피켜스케이팅","프리스타일스키","아이스하키","스키점프","스노보드","스피드스케이팅"},
            {"20","8","바이애슬론","봅슬레이","컬링","피켜스케이팅","프리스타일스키","아이스하키","노르딕복합","쇼트트랙스피드스케이팅"},
            {"21","9","알파인스키","봅슬레이","크로스컨트리스키","컬링","피켜스케이팅","프리스타일스키","아이스하키","스노보드","스피드스케이팅"},
            {"22","8","알파인스키","바이애슬론","컬링","프리스타일스키","아이스하키","노르딕복합","쇼트트랙스피드스케이팅","스노보드"},
            {"23","8","알파인스키","바이애슬론","컬링","피켜스케이팅","프리스타일스키","아이스하키","스노보드","스피드스케이팅"},
            {"24","7","알파인스키","봅슬레이","크로스컨트리스키","컬링","아이스하키","스노보드","스피드스케이팅"},
            {"25","5","봅슬레이","크로스컨트리스키","컬링","피켜스케이팅","아이스하키","폐회식"}
    };

    public SportDate(){
    }

    //전체 일정 return
    public String[][] getDate(){
        return date;
    }

    //받아온 일자가 경기 일정 배열에 있는 경우 일자 [i][0] 를 return, 없으면 쓰레기값인 -1을 return
    public int isInDate(String day){
        for(int i = 0; i < date.length; i++){
            if(day.equals(date[i][0])){
                return i;
            }
        }
        return -1;
    }
}
